In [23]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder
import math
from sklearn.preprocessing import MinMaxScaler,StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.impute import SimpleImputer

In [24]:
#zaczytaj dane z pliku csv
trainDataFrame = pd.read_csv('SalaryData.csv', sep=",")
#sprawdź informacje o tabeli
trainDataFrame.info()
#wyświetl część tabeli
trainDataFrame.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  373 non-null    float64
 1   Gender               373 non-null    object
 2   Education Level      373 non-null    object
 3   Job Title            373 non-null    object
 4   Years of Experience  373 non-null    float64
 5   Salary               373 non-null    float64
dtypes: float64(3), object(3)
memory usage: 17.7+ KB

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [25]:
#usuń puste wiersze
trainDataFrame = trainDataFrame.dropna()
#zamień wartości tekstowe edukacji na liczbowe
education_mapping = {'Bachelor\'s': 1, 'Master\'s': 2, 'PhD': 3}
trainDataFrame['Education Level'] = trainDataFrame['Education Level'].replace(education_mapping)

C:\Users\marci\AppData\Local\Temp\ipykernel_9364\3903661178.py:5: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  trainDataFrame['Education Level'] = trainDataFrame['Education Level'].replace(education_mapping)

In [26]:
# stwórz obiekt enkodera
le = LabelEncoder()
for column in trainDataFrame.columns:
    if pd.api.types.is_object_dtype(trainDataFrame[column]):
        trainDataFrame[column] = le.fit_transform(trainDataFrame[column])
# sprawdź transformacje
trainDataFrame.head()

    Age  Gender  Education Level  Job Title  Years of Experience    Salary
0  32.0       1                1        159                  5.0   90000.0
1  28.0       0                2         17                  3.0   65000.0
2  45.0       1                3        130                 15.0  150000.0
3  36.0       0                1        101                  7.0   60000.0
4  52.0       1                2         22                 20.0  200000.0

In [27]:
#podziel dane na zbiór uczący i testowy
train_df, test_df = train_test_split(trainDataFrame, test_size=0.3, random_state=42)

In [28]:
#stwórz model regresji liniowej
model = LinearRegression().fit(train_df, train_df['Salary'])
prediction = model.predict(test_df)
#wyświetl wyniki predykcji
print(prediction)

[180000.  65000. 125000.  80000. 140000. 160000. 160000. 120000.  50000.
  95000. 140000. 160000.  35000.  95000. 110000.  50000.  90000.  50000.
  90000.  95000. 110000. 105000. 190000.  70000. 100000.  50000. 160000.
  40000. 120000. 170000.  45000. 100000.  60000. 150000. 110000.  35000.
 180000.  50000. 140000.  50000.  40000. 100000. 250000. 170000.  40000.
 140000. 120000.  65000.  55000.  40000. 180000.  90000. 130000. 100000.
 110000. 130000. 170000.  60000. 180000. 100000. 100000. 150000. 180000.
  75000.  45000.  40000.  45000. 110000.  40000.  30000.  75000.  90000.
  60000. 140000. 110000.  95000.  95000.  40000.  70000.  90000. 120000.
 150000.  80000.  90000.  65000. 130000. 100000. 160000.  80000. 110000.
 110000. 170000. 115000. 180000. 140000. 120000. 110000. 115000.  50000.
 140000.  45000.  55000.  50000.    350.  40000.  55000.  45000.  85000.
 150000.  40000. 180000. 140000.]

In [29]:
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score
import numpy as np

#oblicz błędy
mae = mean_absolute_error(test_df['Salary'], prediction)
mse = mean_squared_error(test_df['Salary'], prediction)
rmse = np.sqrt(mse)
r2 = r2_score(test_df['Salary'], prediction)

#wyświetl wyniki
print(f"MAE: {mae}")
print(f"MSE: {mse}")
print(f"RMSE: {rmse}")
print(f"R2 Score: {r2}")

MAE: 2.1499500592524002e-11
MSE: 7.632158540013969e-22
RMSE: 2.762636157733039e-11
R2 Score: 1.0